fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикиОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Превышение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеОтпусков = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
	ЗаполнитьДиаграммуГанта(ДанныеОтпусков, Параметры.Год);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграммуГанта(ДанныеОтпусков, Год)
		
	Диаграмма = ДиаграммаГанта;
	
	Диаграмма.Очистить();
	Диаграмма.ОбластьЗаголовка.Текст = "Запланированные отпуска на " + Год;
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	
	НачалоГода = Дата(Год, 1, 1);
	КонецГода = КонецГода(Дата(Год, 12, 31));
	Диаграмма.УстановитьПолныйИнтервал(НачалоГода, КонецГода);
	
	ЭлементыШкалы = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы;
	ЭлементМесяц = ЭлементыШкалы.Добавить();
	ЭлементМесяц.Единица = ТипЕдиницыШкалыВремени.Месяц;
	ЭлементМесяц.Формат = "ДФ='MMMM'";

	СерияОтпуска = Диаграмма.УстановитьСерию("Текущий документ");
	
	ДанныеОтпусков = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
	СоотвТочек = Новый Соответствие;
	
	Для Каждого СтрокаОтпуска Из ДанныеОтпусков Цикл
	    Сотрудник = СтрокаОтпуска.Сотрудник;
	    
	    Если СоотвТочек.Получить(Сотрудник) = Неопределено Тогда
	        ТочкаСотрудника = Диаграмма.УстановитьТочку(СтрокаОтпуска.Сотрудник);
	        ТочкаСотрудника.Текст = Строка(Сотрудник);
	        СоотвТочек.Вставить(Сотрудник, ТочкаСотрудника);
	    Иначе
	        ТочкаСотрудника = СоотвТочек.Получить(Сотрудник);
	    КонецЕсли;
	    
	    ЗначениеТочки = Диаграмма.ПолучитьЗначение(ТочкаСотрудника, СерияОтпуска);
	    Интервал = ЗначениеТочки.Добавить();
	    
	    Интервал.Начало = СтрокаОтпуска.ДатаНачала;
	    Интервал.Конец = СтрокаОтпуска.ДатаОкончания;
	    Интервал.Текст = Формат(СтрокаОтпуска.ДатаНачала, "ДФ=dd.MM") + " - " + 
	                Формат(СтрокаОтпуска.ДатаОкончания, "ДФ=dd.MM");
	    Интервал.Расшифровка = СтрокаОтпуска.Документ;
	    Интервал.Цвет = WebЦвета.СветлоЗеленый;
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
